[
  {
    "id": "1741992703887",
    "text": "Which prototype do you prefer, and why? 1 (dynamic search),2 (pinned/recently used), or 3 (collapsible).",
    "answers": [
      "1 requires prior knowledge of the settings, which can be challenging for the novice user. Also, even if I know the exact setting I want to change the \"correct\" term for it may be different (ie display vs background). Before I elaborate on 2, I must caveat I've only ever use Android phones so I'm not 100% confident but I'm pretty sure what I'm about to describe is available for iPhones as well. While 2 offers simple, prioritized setting controls, I can access these controls by swiping from the very top of the screen down to toggle them off or on. There's a lot of them available, and the offerings can also be customized. This is why I chose to go with 3, as it is offers the greatest mapping when it comes to discoverability, and also consistency as this is in line with most current setting layouts.",
      "1",
      "2: Pinned and Recently Used. I like the recently used feature especially. The pinned settings would be helpful",
      "I like #2 - I like how accessible everything is. It's nice to have the most frequently used features right at my fingertips",
      "I will pick the first one. It is easier, and it is also consistent with MacOS. If I recall correctly, MacOS has this functionality under System Settings. Definitively will pick that one!",
      "1 because I think it averages out the time of harder to find settings than potentially commonly used ones",
      "I prefer the first, as the search bar is primarily what I use, its faster than the others and gets you exactly where you want.",
      "I prefer Prototype 2. I think that Prototypes 1 and 3 are both excellent as well, but Prototype 2 works particularly well for me since I generally only access very few settings on a regular basis. Thus, the Recently Used section would be very convenient for me since I only need to access a few settings. I do not think that I would use the top row as much since I can use the Control Center, but that is very useful too. Ideally, I would like an interface that combines all three of these prototypes if that is feasible. I think they all have different use cases.",
      "Filled out in the linked Google Forms",
      "Prototype 1 seems the most useful, as I find myself using the search function in Settings in general to find things quickly.",
      "Dynamic search seems like the most useful because it helps you navigate to and immediately change the setting you are looking for.",
      "N/A",
      "I liked the dynamic search option because it was the most flexible in giving me my desired options for IOS settings.",
      "1. useful in life.",
      "I like 3 because it's very neat and tidy.",
      "I choose Prototype 1 since seraching specific function on setting app is something that I face undesired result so this protptype might help me use the seeting app smoothly.",
      "first. very useful in life.",
      "I prefer the first, as the search bar is primarily what I use, its faster than the others and gets you exactly where you want.",
      "2",
      "I like the third the most because it feels most similar to what I currently use, and yet it it's still customizable as expected. I don't like option 1 because it feels like I could accidentally misclick and do the wrong action, as the results are showing up and option 2 feels redundant with the control centre."
    ]
  }
]